#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/fiap-pos-tech/payment-service/runs/run-WT3gMXriehwzXCRT

Waiting for the plan to start...

Terraform v1.7.1
on linux_amd64
Initializing plugins and modules...
data.aws_vpc.main: Refreshing...
data.aws_sns_topic.payment_done: Refreshing...
data.aws_sns_topic.payment_created: Refreshing...
data.aws_ecs_cluster.cluster: Refreshing...
data.aws_apigatewayv2_vpc_link.gateway_vpc_link: Refreshing...
data.aws_security_group.vpc_endpoint_sm_cl: Refreshing...
data.aws_sns_topic.payment_purchase_created: Refreshing...
data.aws_apigatewayv2_api.tech_challenge_api: Refreshing...
data.aws_sns_topic.payment_created: Refresh complete after 0s [id=arn:aws:sns:us-east-1:598135944514:prd-payment-created-topic]
data.aws_sns_topic.payment_done: Refresh complete after 0s [id=arn:aws:sns:us-east-1:598135944514:prd-payment-done-topic]
data.aws_sns_topic.payment_purchase_created: Refresh complete after 0s [id=arn:aws:sns:us-east-1:598135944514:prd-purchase-created-topic]
data.aws_ecs_cluster.cluster: Refresh complete after 0s [id=arn:aws:ecs:us-east-1:598135944514:cluster/tech-challenge]
data.aws_apigatewayv2_api.tech_challenge_api: Refresh complete after 0s [id=5am5sutwt1]
data.aws_apigatewayv2_vpc_link.gateway_vpc_link: Refresh complete after 0s [id=9sezcf]
data.aws_security_group.vpc_endpoint_sm_cl: Refresh complete after 0s [id=sg-0e2dc7c7e10243507]
data.aws_vpc.main: Refresh complete after 0s [id=vpc-0c5a69114563ca731]
data.aws_subnets.database_subnet_ids: Refreshing...
data.aws_subnets.private_subnet_ids: Refreshing...
data.aws_subnets.private_subnet_ids: Refresh complete after 0s [id=us-east-1]
data.aws_subnet.private_selected["subnet-04fba355f9c419a79"]: Refreshing...
data.aws_subnet.private_selected["subnet-03ac578c469316b7b"]: Refreshing...
data.aws_subnet.private_selected["subnet-0f6198953ee43af96"]: Refreshing...
data.aws_subnets.database_subnet_ids: Refresh complete after 0s [id=us-east-1]
data.aws_subnet.database_selected["subnet-0fe0ac5ee5dfc62a8"]: Refreshing...
data.aws_subnet.database_selected["subnet-00f22e8c798c2dc4f"]: Refreshing...
data.aws_subnet.private_selected["subnet-04fba355f9c419a79"]: Refresh complete after 0s [id=subnet-04fba355f9c419a79]
data.aws_subnet.private_selected["subnet-03ac578c469316b7b"]: Refresh complete after 0s [id=subnet-03ac578c469316b7b]
data.aws_subnet.private_selected["subnet-0f6198953ee43af96"]: Refresh complete after 0s [id=subnet-0f6198953ee43af96]
data.aws_subnet.database_selected["subnet-00f22e8c798c2dc4f"]: Refresh complete after 0s [id=subnet-00f22e8c798c2dc4f]
data.aws_subnet.database_selected["subnet-0fe0ac5ee5dfc62a8"]: Refresh complete after 0s [id=subnet-0fe0ac5ee5dfc62a8]
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "database_admin_password"
│ but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-WT3gMXriehwzXCRT/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "AWS_ACCESS_KEY_ID" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-WT3gMXriehwzXCRT/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Values for undeclared variables
│
│ In addition to the other similar warnings shown, 1 other variable(s)
│ defined without being declared.
╵

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_apigatewayv2_integration.apigw_integration will be created
  + resource "aws_apigatewayv2_integration" "apigw_integration" {
      + api_id                                    = "5am5sutwt1"
      + connection_id                             = "9sezcf"
      + connection_type                           = "VPC_LINK"
      + id                                        = (known after apply)
      + integration_method                        = "ANY"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "HTTP_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_route.apigw_route_to_all_internal will be created
  + resource "aws_apigatewayv2_route" "apigw_route_to_all_internal" {
      + api_id             = "5am5sutwt1"
      + api_key_required   = false
      + authorization_type = "CUSTOM"
      + authorizer_id      = "kjuc2x"
      + id                 = (known after apply)
      + route_key          = "ANY /payment/{proxy+}"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_route.apigw_route_to_root will be created
  + resource "aws_apigatewayv2_route" "apigw_route_to_root" {
      + api_id             = "5am5sutwt1"
      + api_key_required   = false
      + authorization_type = "CUSTOM"
      + authorizer_id      = "kjuc2x"
      + id                 = (known after apply)
      + route_key          = "ANY /payment"
      + target             = (known after apply)
    }

  # aws_cloudwatch_log_group.service_log_group will be created
  + resource "aws_cloudwatch_log_group" "service_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/ecs/payment-service"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags              = {
          + "name" = "/ecs/payment-service"
        }
      + tags_all          = {
          + "name"     = "/ecs/payment-service"
          + "workload" = "payment-service"
        }
    }

  # aws_db_subnet_group.docdb_subnet_group will be created
  + resource "aws_db_subnet_group" "docdb_subnet_group" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "payment-service-docdb-subnet-group"
      + name_prefix             = (known after apply)
      + subnet_ids              = [
          + "subnet-00f22e8c798c2dc4f",
          + "subnet-0fe0ac5ee5dfc62a8",
        ]
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name" = "payment-service-docdb-subnet-group"
        }
      + tags_all                = {
          + "Name"     = "payment-service-docdb-subnet-group"
          + "workload" = "payment-service"
        }
      + vpc_id                  = (known after apply)
    }

  # aws_docdb_cluster.docdb_cluster will be created
  + resource "aws_docdb_cluster" "docdb_cluster" {
      + arn                             = (known after apply)
      + availability_zones              = [
          + "us-east-1b",
          + "us-east-1c",
        ]
      + backup_retention_period         = 1
      + cluster_identifier              = "payment-service-cluster"
      + cluster_identifier_prefix       = (known after apply)
      + cluster_members                 = (known after apply)
      + cluster_resource_id             = (known after apply)
      + db_cluster_parameter_group_name = (known after apply)
      + db_subnet_group_name            = "payment-service-docdb-subnet-group"
      + deletion_protection             = false
      + endpoint                        = (known after apply)
      + engine                          = "docdb"
      + engine_version                  = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + id                              = (known after apply)
      + kms_key_id                      = (known after apply)
      + master_password                 = (sensitive value)
      + master_username                 = "sys_payment_service"
      + port                            = 27017
      + preferred_backup_window         = (known after apply)
      + preferred_maintenance_window    = (known after apply)
      + reader_endpoint                 = (known after apply)
      + skip_final_snapshot             = true
      + storage_encrypted               = true
      + tags_all                        = {
          + "workload" = "payment-service"
        }
      + vpc_security_group_ids          = (known after apply)
    }

  # aws_docdb_cluster_instance.approval_flow_instance[0] will be created
  + resource "aws_docdb_cluster_instance" "approval_flow_instance" {
      + apply_immediately               = true
      + arn                             = (known after apply)
      + auto_minor_version_upgrade      = true
      + availability_zone               = (known after apply)
      + ca_cert_identifier              = (known after apply)
      + cluster_identifier              = (known after apply)
      + db_subnet_group_name            = (known after apply)
      + dbi_resource_id                 = (known after apply)
      + endpoint                        = (known after apply)
      + engine                          = "docdb"
      + engine_version                  = (known after apply)
      + id                              = (known after apply)
      + identifier                      = "instance-payment-service-0"
      + identifier_prefix               = (known after apply)
      + instance_class                  = "db.t3.medium"
      + kms_key_id                      = (known after apply)
      + performance_insights_kms_key_id = (known after apply)
      + port                            = (known after apply)
      + preferred_backup_window         = (known after apply)
      + preferred_maintenance_window    = (known after apply)
      + promotion_tier                  = 0
      + publicly_accessible             = (known after apply)
      + storage_encrypted               = (known after apply)
      + tags_all                        = {
          + "workload" = "payment-service"
        }
      + writer                          = (known after apply)
    }

  # aws_docdb_cluster_instance.approval_flow_instance[1] will be created
  + resource "aws_docdb_cluster_instance" "approval_flow_instance" {
      + apply_immediately               = true
      + arn                             = (known after apply)
      + auto_minor_version_upgrade      = true
      + availability_zone               = (known after apply)
      + ca_cert_identifier              = (known after apply)
      + cluster_identifier              = (known after apply)
      + db_subnet_group_name            = (known after apply)
      + dbi_resource_id                 = (known after apply)
      + endpoint                        = (known after apply)
      + engine                          = "docdb"
      + engine_version                  = (known after apply)
      + id                              = (known after apply)
      + identifier                      = "instance-payment-service-1"
      + identifier_prefix               = (known after apply)
      + instance_class                  = "db.t3.medium"
      + kms_key_id                      = (known after apply)
      + performance_insights_kms_key_id = (known after apply)
      + port                            = (known after apply)
      + preferred_backup_window         = (known after apply)
      + preferred_maintenance_window    = (known after apply)
      + promotion_tier                  = 0
      + publicly_accessible             = (known after apply)
      + storage_encrypted               = (known after apply)
      + tags_all                        = {
          + "workload" = "payment-service"
        }
      + writer                          = (known after apply)
    }

  # aws_docdb_cluster_parameter_group.docddb_parameter_group will be created
  + resource "aws_docdb_cluster_parameter_group" "docddb_parameter_group" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + family      = "docdb4.0"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = (known after apply)
      + tags        = {
          + "Name" = "payment-service-cluster-parameter-group"
        }
      + tags_all    = {
          + "Name"     = "payment-service-cluster-parameter-group"
          + "workload" = "payment-service"
        }

      + parameter {
          + apply_method = "pending-reboot"
          + name         = "tls"
          + value        = "disabled"
        }
    }

  # aws_ecs_service.service will be created
  + resource "aws_ecs_service" "service" {
      + cluster                            = "arn:aws:ecs:us-east-1:598135944514:cluster/tech-challenge"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + health_check_grace_period_seconds  = 120
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "payment-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "workload" = "payment-service"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "payment-service-container"
          + container_port   = 8080
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = [
              + "subnet-03ac578c469316b7b",
              + "subnet-04fba355f9c419a79",
              + "subnet-0f6198953ee43af96",
            ]
        }
    }

  # aws_ecs_task_definition.task_definition will be created
  + resource "aws_ecs_task_definition" "task_definition" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "1024"
      + execution_role_arn       = (known after apply)
      + family                   = "tsk-payment-service"
      + id                       = (known after apply)
      + memory                   = "2048"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = {
          + "workload" = "payment-service"
        }
      + task_role_arn            = (known after apply)
    }

  # aws_iam_role.service_execution_role will be created
  + resource "aws_iam_role" "service_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = "01"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "payment_service_service_execution_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "workload" = "payment-service"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.service_execution_policy will be created
  + resource "aws_iam_role_policy" "service_execution_policy" {
      + id          = (known after apply)
      + name        = "payment_service_service_execution_policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_lb.alb will be created
  + resource "aws_lb" "alb" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = true
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "payment-service-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = [
          + "subnet-03ac578c469316b7b",
          + "subnet-04fba355f9c419a79",
          + "subnet-0f6198953ee43af96",
        ]
      + tags                                                         = {
          + "name" = "payment-service-alb"
        }
      + tags_all                                                     = {
          + "name"     = "payment-service-alb"
          + "workload" = "payment-service"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)
    }

  # aws_lb_listener.listener_http will be created
  + resource "aws_lb_listener" "listener_http" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = {
          + "workload" = "payment-service"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.target_group will be created
  + resource "aws_lb_target_group" "target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "payment-service-tg"
      + name_prefix                        = (known after apply)
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = {
          + "workload" = "payment-service"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0c5a69114563ca731"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200"
          + path                = "/monitor/health"
          + port                = "8080"
          + protocol            = "HTTP"
          + timeout             = 10
          + unhealthy_threshold = 10
        }
    }

  # aws_s3_bucket.cert_bucket will be created
  + resource "aws_s3_bucket" "cert_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "docdb-certs"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "docdb-certs"
        }
      + tags_all                    = {
          + "Name"     = "docdb-certs"
          + "workload" = "payment-service"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_object.static_content["global-bundle.pem"] will be created
  + resource "aws_s3_object" "static_content" {
      + acl                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "d268b9ebb42f308ee716a93903b0aecb"
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "global-bundle.pem"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./certs/global-bundle.pem"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "workload" = "payment-service"
        }
      + version_id             = (known after apply)
    }

  # aws_secretsmanager_secret.app_database_password_secret will be created
  + resource "aws_secretsmanager_secret" "app_database_password_secret" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "service/Payment/Database/Credential"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = {
          + "workload" = "payment-service"
        }
    }

  # aws_secretsmanager_secret_version.app_database_password_version will be created
  + resource "aws_secretsmanager_secret_version" "app_database_password_version" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_security_group.alb_sg will be created
  + resource "aws_security_group" "alb_sg" {
      + arn                    = (known after apply)
      + description            = "payment-service alb security group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTP"
              + from_port        = 80
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "alb-payment-service-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "alb-payment-service-sg"
        }
      + tags_all               = {
          + "Name"     = "alb-payment-service-sg"
          + "workload" = "payment-service"
        }
      + vpc_id                 = "vpc-0c5a69114563ca731"
    }

  # aws_security_group.documentdb_sg will be created
  + resource "aws_security_group" "documentdb_sg" {
      + arn                    = (known after apply)
      + description            = "payment-service documentdb security group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Allow Request From ECS"
              + from_port        = 27017
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 27017
            },
        ]
      + name                   = "payment-service-documentdb-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "payment-service-documentdb-sg"
        }
      + tags_all               = {
          + "Name"     = "payment-service-documentdb-sg"
          + "workload" = "payment-service"
        }
      + vpc_id                 = "vpc-0c5a69114563ca731"
    }

  # aws_security_group.service_sg will be created
  + resource "aws_security_group" "service_sg" {
      + arn                    = (known after apply)
      + description            = "payment-service security group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Allow Request From Target Group"
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 8080
            },
        ]
      + name                   = "payment-service-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "payment-service-sg"
        }
      + tags_all               = {
          + "Name"     = "payment-service-sg"
          + "workload" = "payment-service"
        }
      + vpc_id                 = "vpc-0c5a69114563ca731"
    }

  # aws_security_group_rule.ecs_to_vpc_endpoints will be created
  + resource "aws_security_group_rule" "ecs_to_vpc_endpoints" {
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0e2dc7c7e10243507"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # aws_sns_topic_subscription.get_payment_purchase_created_events will be created
  + resource "aws_sns_topic_subscription" "get_payment_purchase_created_events" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "sqs"
      + raw_message_delivery            = true
      + topic_arn                       = "arn:aws:sns:us-east-1:598135944514:prd-purchase-created-topic"
    }

  # aws_sqs_queue.payment_purchase_created_dlq will be created
  + resource "aws_sqs_queue" "payment_purchase_created_dlq" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 86400
      + name                              = "prd-payment-purchase-created-queue-dlq"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = true
      + tags_all                          = {
          + "workload" = "payment-service"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 60
    }

  # aws_sqs_queue.payment_purchase_created_queue will be created
  + resource "aws_sqs_queue" "payment_purchase_created_queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 86400
      + name                              = "prd-payment-purchase-created-queue"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = true
      + tags_all                          = {
          + "workload" = "payment-service"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 60
    }

  # aws_sqs_queue_policy.payment_purchase_created_to_process_subscription will be created
  + resource "aws_sqs_queue_policy" "payment_purchase_created_to_process_subscription" {
      + id        = (known after apply)
      + policy    = (known after apply)
      + queue_url = (known after apply)
    }

Plan: 28 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @antoniogabrielti, Action: `pull_request`*